print("Добро пожаловать в квест: Побег от Дракона! 🐉")
print("Перед тобой две двери: 1 - Красная 🔴, 2 - Синяя 🔵")

# Задание 1: Сделай так, чтобы игра спросила игрока, какую дверь он выберет
door = _______("Какую дверь откроешь? Напиши 1 или 2: ")

# Задание 2: Напиши правильное условие (двойное равно)
if door __ "1":
    print("О нет! Там спит Дракон 🐲! Он проснулся!")
    print("Что будешь делать? 1 - Бежать 🏃‍♂️, 2 - Кинуть ему сосиску 🌭")
    action = input("Твой выбор: ")
    
    # Задание 3: Допиши условие
    if action == "1":
        print("Дракон летает быстрее. Ты проиграл! 💀")
    ____ action == "2": # Если иначе (elif)
        print("Дракон съел сосиску и уснул. Ты спасен! 🎉")
    _____: # Во всех остальных случаях
        print("Ты ничего не сделал и дракон тебя съел!")

# Задание 4: Что будет, если выбрали Синюю дверь?
elif door == "2":
    print("Там комната с золотом! 💰 Ты стал богачом и победил! 🏆")

else:
    print("Такой двери нет! Ты врезался в стену 🧱.")
