import turtle

print("Привет! Я Умная Черепашка 🐢")
print("Какой цвет ты хочешь? 1 - Красный, 2 - Синий")

# Спрашиваем у пользователя
choice = input("Напиши цифру 1 или 2: ")

t = turtle.Turtle()
t.shape("turtle")
t.width(5)

# Проверяем ответ (вставь if и двойное равно)
___ choice __ "1":
    print("Включаю красный цвет! 🔴")
    t.color("red")

# Вставь "иначе если" (elif)
____ choice == "2":
    print("Включаю синий цвет! 🔵")
    t.color("blue")

# Вставь "иначе" для всех остальных кнопок
____:
    print("Я не знаю такой цвет, буду зеленой! 🟢")
    t.color("green")

# Черепашка рисует линию в выбранном цвете
t.forward(150)
t.circle(50) # А это сюрприз — черепашка нарисует круг!

turtle.done()
