#Задача: Нарисовать правильный шестиугольник. Цвет контура один, цвет заливки задан в формате RGB.
import turtle
turtle.colormode()      # ВАЖНО! Включаем режим RGB от 0 до 255 (иначе будет ошибка)

t = turtle.Turtle()
t.shape("turtle")
t.pensize(3)

t.pencolor("")                 # Контур черный
t.fillcolor()            # Заливка оранжевая (Red: 255, Green: 165, Blue: 0)

t.begin_fill()                      # Говорим: "Начинаем закрашивать то, что сейчас нарисуем!"

for i in range():                  # У шестиугольника 6 сторон
    t.forward()
    t.left()                      # 360 / 6 = 60 градусов

t.end_fill()                        # Говорим: "Заканчиваем рисовать, заливай краску!"

turtle.done()