#Задача: Мы знаем, что угол для 5-конечной звезды равен 144 градусам. Нарисуй звезду из 40 линий, 
# где каждая следующая линия становится на 10 пикселей длиннее. Это создаст красивый эффект объема.
#Подсказка: Создай переменную для длины линии, начни с 20. В цикле рисуй линию, поворачивай на 144 и увеличивай длину.

import turtle

t = turtle.Turtle()
t.speed(0)
t.pencolor("gold")

dlina = 20 # Стартовая длина

for i in range(40):
    t.forward(dlina)
    t.right(144)      # Угол звезды
    dlina = dlina + 10 # Линия растет

turtle.done()