#Задача: Нарисуй паутину. Для этого нужно сделать шестиугольник, но он не должен замыкаться. 
# Угол правильного шестиугольника (для поворота Черепахи) равен 60 градусам. Если сделать угол поворота ровно 60, фигура замкнется. 
# Если сделать угол поворота 59 градусов (чуть меньше), 
# получится спиральная паутина! Длину линии нужно постоянно увеличивать.

import turtle

t = turtle.Turtle()
t.speed(0)
t.pencolor("black")
turtle.bgcolor("lightblue") # Цвет фона для красоты

line_length = 5

for i in range(80): # 80 линий паутины
    t.forward(line_length)
    t.left(59)               # Угол чуть меньше 60 дает эффект смещения!
    line_length = line_length + 4 # Увеличиваем размер

turtle.done()