#Задача: Нарисовать круглую спираль. С каждым шагом линия должна становиться не только длиннее, но и толще.
#  Нам понадобятся две переменные!

import turtle

t = turtle.Turtle()
t.speed(0)
t.pencolor("purple")

# Две переменные: одна для движения, другая для толщины
step = 5
thickness = 1

for i in range(40):
    t.pensize(thickness) # Устанавливаем текущую толщину пера
    t.forward(step)      # Делаем шаг
    t.left(25)           # Поворачиваем, чтобы закруглять линию
    
    # Обновляем обе переменные!
    step = step + 5          # Шаг увеличивается на 5
    thickness = thickness + 1 # Толщина увеличивается на 1

turtle.done()