#Задача: Задать размер стороны и угол через переменные и нарисовать многоугольник.

import turtle

t = turtle.Turtle()
t.shape("turtle")
t.pensize(3)
t.pencolor("blue")

# Создаем переменные (кладем числа в коробочки)
dlina = 100      # Переменная для длины стороны
ugol = 120       # Переменная для угла (120 - будет треугольник)

for i in range(3):
    t.forward(dlina)     # Черепашка берет число из коробочки dlina (100)
    t.left(ugol)         # Черепашка берет число из коробочки ugol (120)

turtle.done()