#Задача: Нарисовать квадратную спираль, но контролировать рост линии самостоятельно с помощью size = size + 15.

import turtle

t = turtle.Turtle()
t.shape("turtle")
t.speed(0)

# Создаем переменную для начального размера
size = 10 

for i in range(30):
    t.forward(size)      # Идем вперед на текущее значение size
    t.left(90)           # Поворачиваем (прямой угол)
    
    # МАГИЯ: Увеличиваем значение переменной на 15 на каждом шаге!
    # На 1-м круге size=10, на 2-м size=25, на 3-м size=40 и т.д.
    size = size + 15     

turtle.done()