#Задача: Написать программу, которая выскакивающим окном спрашивает у ученика,
#  сколько сторон должно быть у фигуры, и рисует её. Компьютер сам посчитает угол!

import turtle

t = turtle.Turtle()
t.shape("turtle")
t.speed(5)

# numinput("Заголовок окна", "Вопрос") открывает окно для ввода числа
# int() превращает введенное значение в целое число (убирает дроби)
sides = int(turtle.numinput("Фигуры", "Сколько углов будем рисовать? (Например, 5 или 8)"))
length = 100

# Компьютер сам считает правильный угол (360 делим на количество сторон)
# Сохраняем результат в новую переменную
angle = 360 / sides

# Рисуем фигуру (переменная sides идет в range, чтобы повторить нужное количество раз)
for i in range(sides):
    t.forward(length)
    t.left(angle)

turtle.done()