#Задача: Нарисовать правильный шестиугольник. Цвет контура один, цвет заливки задан в формате RGB.
import turtle
turtle.colormode(255)      # ВАЖНО! Включаем режим RGB от 0 до 255 (иначе будет ошибка)

t = turtle.Turtle()
t.shape("turtle")
t.pensize(3)

t.pencolor("black")                 # Контур черный
t.fillcolor(255, 165, 0)            # Заливка оранжевая (Red: 255, Green: 165, Blue: 0)

t.begin_fill()                      # Говорим: "Начинаем закрашивать то, что сейчас нарисуем!"

for i in range(6):                  # У шестиугольника 6 сторон
    t.forward(100)
    t.left(60)                      # 360 / 6 = 60 градусов

t.end_fill()                        # Говорим: "Заканчиваем рисовать, заливай краску!"

turtle.done()