#Задача: Используем penup/pendown и команду circle(), чтобы нарисовать два круга разного цвета, не соединяя их линией.

import turtle
turtle.colormode(255)

t = turtle.Turtle()
t.shape("turtle")
t.pensize(2)

# --- Рисуем красный свет ---
t.fillcolor(255, 0, 0) # Чисто красный в RGB
t.begin_fill()
t.circle(40)           # Рисуем круг радиусом 40 пикселей
t.end_fill()

# --- Прыжок вниз ---
t.penup()              # Поднимаем перо (хвост черепахи)
t.right(90)            # Поворачиваемся вниз
t.forward(100)         # Пролетаем 100 пикселей без следа
t.left(90)             # Возвращаемся в исходное положение (смотрим вправо)
t.pendown()            # Опускаем перо (готовы рисовать)

# --- Рисуем желтый свет ---
t.fillcolor("#E2EC29") # Желтый в HEX
t.begin_fill()
t.circle(40)
t.end_fill()

# --- Прыжок вниз ---
t.penup()              # Поднимаем перо (хвост черепахи)
t.right(90)            # Поворачиваемся вниз
t.forward(100)         # Пролетаем 100 пикселей без следа
t.left(90)             # Возвращаемся в исходное положение (смотрим вправо)
t.pendown()            # Опускаем перо (готовы рисовать)

# --- Рисуем зеленый свет ---
t.fillcolor("#32CD32") # Зеленый (LimeGreen) в HEX
t.begin_fill()
t.circle(40)
t.end_fill()

turtle.done()