# Задача 1. "Зоопарк – программистская версия"
# В зоопарке каждое животное отвечает за выполнение одной функции.
# Создай словарь, где ключи — это названия животных, а значения — их «обязанности».
# Например, 
animals = {'Обезьяна': 'собирать бананы',
           'Слон': 'поднимать бревна',
           'Попугай': 'общаться с посетителями'}

#Задание:

# 1) Добавь в словарь еще три животных и их обязанности.
# 2) Напиши функцию, которая выводит на экран, какое животное что делает, с шутливым описанием.
# 3) Проверь, есть ли в зоопарке "Енот", и если его нет,
#    добавь его с обязанностью "проверять мусорные баки".
