# Задача 2. "Магазин мемов"
# У тебя есть список популярных мемов:

memes = ["Кот в коробке", "Грустный смайл", "Улыбка Шрека", "Мем с Леонардо", "Джин из Аладдина"]

#Задание:

# 1) Напиши программу, которая случайно выбирает мем из списка и
#    предлагает его продать за случайную сумму денег.
# 2) Если сумма больше 100, программа должна радостно сказать:
#    «Это редкость! Продавай быстрее!».
#    Если сумма меньше 100, программа грустно скажет:
#    «Хм, цена низкая, оставь себе на коллекцию».
# 3) Подсказка: используй модуль random для выбора мемов и генерации цен.