# Задача 3. "Сортировка пиццы"
# Есть список из названий пицц:

pizzas = ["Маргарита", "Пепперони", "Четыре сыра", "Гавайская", "Мясная бомба", "С креветками"]

#Задание:

# 1) Пользователь вводит название любимой пиццы. Если такая пицца есть в списке,
#    программа отвечает: «Вау, ты любишь [название пиццы]! Это вкусно!».
# 2) Если пиццы нет в списке, программа добавляет её с комментариями:
#    «Теперь [название пиццы] будет в нашем меню».
# 3) Выведи весь список пицц в алфавитном порядке (программно!).
