# Задача 4. "Шуточная доска почета"
# Создай словарь, где ключи — имена учеников, а значения — их самые смешные достижения.
#  Например:

students = {
    "Аня": "Съела 10 бургеров за раз",
    "Миша": "Прыгнул выше шкафа",
    "Катя": "Выиграла баттл по скороговоркам"
}

# Задание:

# 1) Добавь в словарь достижения еще трех учеников.
# 2) Напиши программу, которая выводит случайное имя и его достижение в формате:
#    «Поздравляем [имя]! За достижение: [достижение]!».
# 3) Реализуй функцию добавления нового достижения
#    для любого ученика (пользователь вводит имя и достижение).