# Задача 5. "Генератор отмазок"
# Создай два массива:

start = ["Я не сделал ДЗ, потому что",
         "Я опоздал на урок, потому что",
         "У меня не получилось, потому что"]

end = ["кот съел тетрадь",
       "компьютер решил поспать", 
       "меня похитили инопланетяне",
       "кошка нажала на выключение света"]

# Задание:

# 1) Программа должна случайно выбирать одну фразу из каждого массива
#    и выводить результат в виде смешной отмазки.
# 2) Добавь возможность пользователю самому предложить новый вариант в оба списка.