#Задача: Давайте покажем, что переменная i из for i in range() — это не просто буква, а число,
#  которое увеличивается с каждым шагом (0, 1, 2, 3...). Используем её для увеличения длины линии!

import turtle

t = turtle.Turtle()
t.speed(0)
t.pencolor("#FF4500") # Оранжево-красный (OrangeRed)

for i in range(100):      # i будет расти от 0 до 99
    # Каждый раз линия становится длиннее на размер i * 3
    t.forward(i * 2)      
    t.left(20)            # Небольшой поворот создает эффект спирали-пружинки

turtle.done()