#Задача: Теперь нарисуем красивый узор из квадратов. Внутренний цикл рисует сам квадрат, 
# а внешний отвечает за их количество и поворот.

import turtle
turtle.colormode(255)

t = turtle.Turtle()
t.speed(0)
t.pencolor(138, 43, 226) # Фиолетовый (RGB)

# ВНЕШНИЙ ЦИКЛ: отвечает за количество квадратов
for i in range(36): 
    
    # ВНУТРЕННИЙ ЦИКЛ: рисует ОДИН квадрат
    for j in range(4):
        t.forward(100)
        t.left(90)
        
    # Возвращаемся во внешний цикл и делаем поворот для следующего квадрата
    t.right(10)

turtle.done()