#Задача: Вместо того чтобы ходить вперед и поворачивать, нарисуем квадрат, 
# просто перемещаясь по 4 заданным координатам.
#  Заодно познакомимся с командой t.dot() (нарисовать точку).

import turtle

t = turtle.Turtle()
t.shape("turtle")
t.pensize(3)

# 1. Правый верхний угол (X с плюсом, Y с плюсом)
t.goto(100, 100)
t.dot(15, "red") # Рисует кружочек (точку) диаметром 15 пикселей красного цвета

# 2. Левый верхний угол (X с минусом, Y с плюсом)
t.goto(-100, 100)
t.dot(15, "blue")

# 3. Левый нижний угол (X с минусом, Y с минусом)
t.goto(-100, -100)
t.dot(15, "green")

# 4. Правый нижний угол (X с плюсом, Y с минусом)
t.goto(100, -100)
t.dot(15, "orange")

# 5. Возвращаемся в центр, чтобы замкнуть квадрат
t.goto(0, 0)

turtle.done()