#Задача: Напиши программу, где Черепашка ходит вперед на фиксированное расстояние (например, 20 пикселей), 
# но перед каждым шагом поворачивается на случайный угол от 0 до 360 градусов. 
# Посмотри, какой странный путь она нарисует! (Это реальный алгоритм, который используют в физике).

import turtle
import random

t = turtle.Turtle()
t.speed(0)
t.pensize(2)

for i in range(200): # Делаем 200 шагов
    # Генерируем случайный угол для поворота налево
    random_angle = random.randint(0, 360)
    
    t.left(random_angle) # Поворачиваемся куда глаза глядят
    t.forward(20)        # Делаем шаг

turtle.done()